---
kind: method
id: M:Autodesk.Revit.DB.DocumentSetIterator.#ctor
source: html/cc2e7212-8034-b171-4cf2-8b9122df5e92.htm
---
# Autodesk.Revit.DB.DocumentSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DocumentSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.